In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv(r"E:\jupyter notebook\Machine Learning\Naive Bayes\Data set\titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis ="columns",inplace = True)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [4]:
target = df["Survived"]
inputs = df.drop(["Survived"],axis = "columns")

In [5]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [6]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

# For Encoding

In [7]:
dummies= pd.get_dummies(inputs["Sex"])

In [8]:
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

# For Concatenated

In [9]:
marged =pd.concat([inputs,dummies], axis ="columns")

In [10]:
marged

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [11]:
marged.drop(["Sex"], axis = "columns", inplace=True)
marged.head(6)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1
5       3   NaN   8.4583       0     1

In [12]:
marged.shape

(891, 5)

In [13]:
marged.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [14]:
missing=marged["Age"].mean()

In [15]:
missing

29.69911764705882

In [16]:
marged["Age"] = marged["Age"].fillna(missing)
marged.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [17]:
marged.isnull().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [18]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest= train_test_split(marged,target,test_size=.20,random_state=1)

In [19]:
len(xtrain)

712

In [20]:
len(xtest)

179

In [21]:
len(marged)

891

# For Navie Bayes(GaussianNB)

In [22]:
from sklearn.naive_bayes import GaussianNB

In [23]:
GNB = GaussianNB()

In [24]:
GNB.fit(xtrain , ytrain)

GaussianNB()

In [25]:
GNB.score(xtest, ytest)

0.776536312849162

# For Navie Bayes(BernoulliNB)

In [26]:
from sklearn.naive_bayes import BernoulliNB

In [27]:
model_BNB = BernoulliNB()

In [28]:
model_BNB.fit(xtrain, ytrain)

BernoulliNB()

In [29]:
model_BNB.score(xtest, ytest)

0.776536312849162

# For Navie Bayes(MultinomialNB)

In [30]:
from sklearn.naive_bayes import MultinomialNB

In [31]:
model_MNB = MultinomialNB()

In [32]:
model_MNB.fit(xtrain, ytrain)

MultinomialNB()

In [33]:
model_MNB.score(xtest, ytest)

0.6480446927374302